log/2015-03-18-13.21.03.log

Execute Anonymous

================================

FeatureUpgrades.doFeatureUpgrades12_11();

================================

31.0 APEX_CODE,DEBUG;APEX_PROFILING,DEBUG;CALLOUT,INFO;DB,INFO;VALIDATION,INFO;WORKFLOW,INFO
Execute Anonymous: FeatureUpgrades.doFeatureUpgrades12_11();
11:21:02.522 (522618362)|EXECUTION_STARTED
11:21:02.522 (522628467)|CODE_UNIT_STARTED|[EXTERNAL]|execute_anonymous_apex
11:21:02.599 (599390923)|METHOD_ENTRY|[1]|01po0000003nulZ|FeatureUpgrades.FeatureUpgrades()
11:21:02.627 (627679305)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.MetadataUtils()
11:21:02.627 (627764629)|METHOD_EXIT|[2]|MetadataUtils
11:21:02.627 (627803383)|METHOD_ENTRY|[2]|01po0000003Oh7F|MetadataUtils.createService()
11:21:02.634 (634109965)|CONSTRUCTOR_ENTRY|[9]|01po0000003Oh7D|<init>()
11:21:02.634 (634544286)|CONSTRUCTOR_EXIT|[9]|01po0000003Oh7D|<init>()
11:21:02.634 (634573884)|CONSTRUCTOR_ENTRY|[11]|01po0000003Oh7D|<init>()
11:21:02.634 (634670056)|CONSTRUCTOR_EXIT|[11]|01po0000003Oh7D|<init>()
11:21:02.642 (642199923)|METHOD_EXIT|[2]|01po0000003Oh7F|MetadataUtils.createService()
11:21:02.642 (642218830)|METHOD_EXIT|[1]|FeatureUpgrades
11:21:02.642 (642246066)|METHOD_ENTRY|[1]|01po0000003nulZ|FeatureUpgrades.doFeatureUpgrades12_11()
11:21:02.642 (642449004)|METHOD_ENTRY|[10]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:21:02.674 (674728114)|METHOD_ENTRY|[1]|01po0000000dllI|Utils.Utils()
11:21:02.675 (675562671)|METHOD_EXIT|[1]|Utils
11:21:02.675 (675594218)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.678 (678605332)|METHOD_ENTRY|[1]|01po0000000dlkU|Constants.Constants()
11:21:02.684 (684021403)|METHOD_EXIT|[1]|Constants
11:21:02.684 (684048447)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.684 (684067353)|METHOD_ENTRY|[600]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.684 (684084167)|METHOD_EXIT|[600]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.684 (684098700)|METHOD_EXIT|[10]|01po0000003Oh7F|MetadataUtils.addNamespaceToCustomObjectLayout(String)
11:21:02.684 (684149739)|METHOD_ENTRY|[11]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:21:02.687 (687728308)|CONSTRUCTOR_ENTRY|[8870]|01po0000003Oh7D|<init>()
11:21:02.687 (687912658)|CONSTRUCTOR_EXIT|[8870]|01po0000003Oh7D|<init>()
11:21:02.694 (694128741)|CALLOUT_REQUEST|[8876]|<?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><env:Header><SessionHeader xmlns="http://soap.sforce.com/2006/04/metadata"><sessionId>00Do0000000HyRH!AQYAQN8haRiIUPIy8IqJdQuuONXpAnNLoOdGuf7fuC3RKyMySkJ3eqSwsblo8.B5_Fi3Y0VDRwn5grPbtgdnJOZulbPGd23U</sessionId></SessionHeader></env:Header><env:Body><readMetadata xmlns="http://soap.sforce.com/2006/04/metadata"><type>Layout</type><fullNames>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullNames></readMetadata></env:Body></env:Envelope>
11:21:02.694 (694180089)|CALLOUT_REQUEST|[8876]|readMetadata_element:[apex_schema_type_info=(http://soap.sforce.com/2006/04/metadata, true, false), field_order_type_info=(type_x, fullNames), fullNames=(TeamRaiser_Registration__c-TeamRaiser Registration Layout), fullNames_type_info=(fullNames, http://soap.sforce.com/2006/04/metadata, null, 0, -1, false), type_x=Layout, type_x_type_info=(type, http://soap.sforce.com/2006/04/metadata, null, 1, 1, false)]::SFDC_STACK_DEPTH=1 SOAPAction="" User-Agent=SFDC-Callout/33.0 Accept=text/xml Content-Type=text/xml; charset=UTF-8 
11:21:02.853 (853908126)|CALLOUT_RESPONSE|[8876]|<?xml version="1.0" encoding="UTF-8"?><soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns="http://soap.sforce.com/2006/04/metadata" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Body><readMetadataResponse><result><records xsi:type="Layout"><fullName>TeamRaiser_Registration__c-TeamRaiser Registration Layout</fullName><excludeButtons>Submit</excludeButtons><layoutSections><customLabel>true</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>TeamRaiser Progress</label><layoutColumns><layoutItems><height>420</height><page>TeamRaiserProgressWidget</page><showLabel>false</showLabel><showScrollbars>false</showScrollbars><width>100%</width></layoutItems></layoutColumns><style>OneColumn</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>false</detailHeading><editHeading>true</editHeading><label>Information</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Name</field></layoutItems><layoutItems><behavior>Required</behavior><field>Contact__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participation_Type__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Participant_s_Home_Page__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Registration_Date__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Opportunity__c</field></layoutItems><layoutItems><behavior>Required</behavior><field>TeamRaiser_Participation_Type__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Campaign__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team_Captain__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Team__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Fundraising_Goal__c</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Separator</label><layoutColumns><layoutItems><behavior>Required</behavior><field>Registration_Fee__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Total_Raised__c</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Required</behavior><field>Extra_Gift__c</field></layoutItems><layoutItems><behavior>Edit</behavior><field>Upsell_Amount__c</field></layoutItems></layoutColumns><style>TwoColumnsLeftToRight</style></layoutSections><layoutSections><customLabel>false</customLabel><detailHeading>true</detailHeading><editHeading>true</editHeading><label>System Information</label><layoutColumns><layoutItems><behavior>Readonly</behavior><field>CreatedById</field></layoutItems></layoutColumns><layoutColumns><layoutItems><behavior>Readonly</behavior><field>LastModifiedById</field></layoutItems></layoutColumns><style>TwoColumnsTopToBottom</style></layoutSections><layoutSections><customLabel>true</customLabel><detailHeading>false</detailHeading><editHeading>false</editHeading><label>Custom Links</label><layoutColumns/><layoutColumns/><layoutColumns/><style>CustomLinks</style></layoutSections><relatedLists><fields>OPPORTUNITY.NAME</fields><fields>ACCOUNT.NAME</fields><fields>OPPORTUNITY.CLOSE_DATE</fields><fields>OPPORTUNITY.AMOUNT</fields><relatedList>Opportunity.TeamRaiser_Registration__c</relatedList></relatedLists><relatedLists><fields>NAME</fields><fields>Upsell_Item__c</fields><fields>Item_Price__c</fields><fields>Item_Quantity__c</fields><fields>Total_Amount__c</fields><fields>Date_Fulfilled__c</fields><relatedList>TeamRaiser_Registration_Upsell__c.TeamRaiser_Registration__c</relatedList></relatedLists><showEmailCheckbox>false</showEmailCheckbox><showHighlightsPanel>false</showHighlightsPanel><showInteractionLogPanel>false</showInteractionLogPanel><showRunAssignmentRulesCheckbox>false</showRunAssignmentRulesCheckbox><showSubmitAndAttachButton>false</showSubmitAndAttachButton><summaryLayout><masterLabel>00hE0000001CHzf</masterLabel><sizeX>4</sizeX><sizeY>0</sizeY><summaryLayoutStyle>Default</summaryLayoutStyle></summaryLayout></records></result></readMetadataResponse></soapenv:Body></soapenv:Envelope>
11:21:02.875 (875683862)|CONSTRUCTOR_ENTRY|[4077]|01po0000003Oh7D|<init>()
11:21:02.875 (875866466)|CONSTRUCTOR_EXIT|[4077]|01po0000003Oh7D|<init>()
11:21:02.894 (894917303)|CALLOUT_RESPONSE|[8876]|
11:21:02.895 (895074054)|METHOD_ENTRY|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:21:02.895 (895101692)|METHOD_EXIT|[8889]|01po0000003Oh7D|MetadataService.readLayoutResponse_element.getResult()
11:21:02.895 (895110990)|METHOD_EXIT|[11]|01po0000003Oh7D|MetadataService.MetadataPort.readMetadata(String, List<String>)
11:21:02.895 (895127706)|METHOD_ENTRY|[11]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:21:02.895 (895139099)|METHOD_EXIT|[11]|01po0000003Oh7D|MetadataService.ReadLayoutResult.getRecords()
11:21:02.895 (895218575)|METHOD_ENTRY|[14]|01po0000003nulZ|FeatureUpgrades.addFundraisingGoalToLayout(MetadataService.Layout)
11:21:02.895 (895242777)|CONSTRUCTOR_ENTRY|[21]|01po0000003Oh7D|<init>()
11:21:02.895 (895429547)|CONSTRUCTOR_EXIT|[21]|01po0000003Oh7D|<init>()
11:21:02.895 (895443227)|METHOD_ENTRY|[22]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.895 (895470155)|METHOD_EXIT|[22]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.895 (895547083)|METHOD_ENTRY|[23]|01po0000003Oh7F|MetadataUtils.addFieldsToLayout(MetadataService.Layout, String, List<MetadataService.LayoutItem>, Integer)
11:21:02.895 (895569520)|METHOD_ENTRY|[370]|01po0000003Oh7F|MetadataUtils.getFieldsNotOnLayout(MetadataService.Layout, List<MetadataService.LayoutItem>)
11:21:02.895 (895831109)|METHOD_ENTRY|[408]|01po0000003Oh7F|MetadataUtils.isFieldInLayout(String, MetadataService.Layout)
11:21:02.896 (896589361)|METHOD_EXIT|[408]|01po0000003Oh7F|MetadataUtils.isFieldInLayout(String, MetadataService.Layout)
11:21:02.896 (896614902)|METHOD_EXIT|[370]|01po0000003Oh7F|MetadataUtils.getFieldsNotOnLayout(MetadataService.Layout, List<MetadataService.LayoutItem>)
11:21:02.896 (896630503)|CONSTRUCTOR_ENTRY|[372]|01po0000003Oh7D|<init>()
11:21:02.896 (896730281)|CONSTRUCTOR_EXIT|[372]|01po0000003Oh7D|<init>()
11:21:02.896 (896743189)|CONSTRUCTOR_ENTRY|[373]|01po0000003Oh7D|<init>()
11:21:02.896 (896798092)|CONSTRUCTOR_EXIT|[373]|01po0000003Oh7D|<init>()
11:21:02.896 (896979887)|METHOD_EXIT|[23]|01po0000003Oh7F|MetadataUtils.addFieldsToLayout(MetadataService.Layout, String, List<MetadataService.LayoutItem>, Integer)
11:21:02.896 (896987043)|METHOD_EXIT|[14]|01po0000003nulZ|FeatureUpgrades.addFundraisingGoalToLayout(MetadataService.Layout)
11:21:02.897 (897039972)|METHOD_ENTRY|[15]|01po0000003nulZ|FeatureUpgrades.addTrProgressWidgetToLayout(MetadataService.Layout)
11:21:02.897 (897083411)|METHOD_ENTRY|[63]|01po0000003nulZ|FeatureUpgrades.getTrProgressWidgetLayoutSection()
11:21:02.897 (897099035)|CONSTRUCTOR_ENTRY|[44]|01po0000003Oh7D|<init>()
11:21:02.897 (897186014)|CONSTRUCTOR_EXIT|[44]|01po0000003Oh7D|<init>()
11:21:02.897 (897205434)|CONSTRUCTOR_ENTRY|[49]|01po0000003Oh7D|<init>()
11:21:02.897 (897257354)|CONSTRUCTOR_EXIT|[49]|01po0000003Oh7D|<init>()
11:21:02.897 (897265783)|CONSTRUCTOR_ENTRY|[50]|01po0000003Oh7D|<init>()
11:21:02.897 (897477972)|CONSTRUCTOR_EXIT|[50]|01po0000003Oh7D|<init>()
11:21:02.897 (897494294)|METHOD_ENTRY|[52]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.897 (897516717)|METHOD_EXIT|[52]|01po0000000dllI|Utils.addNamespace(String)
11:21:02.897 (897582268)|METHOD_EXIT|[63]|01po0000003nulZ|FeatureUpgrades.getTrProgressWidgetLayoutSection()
11:21:02.897 (897598860)|METHOD_ENTRY|[63]|01po0000003Oh7F|MetadataUtils.addSectionToLayouts(List<MetadataService.Layout>, MetadataService.LayoutSection, Integer)
11:21:02.897 (897733637)|METHOD_ENTRY|[588]|01po0000003Oh7F|MetadataUtils.getSectionFromLayout(String, MetadataService.Layout)
11:21:02.897 (897827744)|METHOD_EXIT|[588]|01po0000003Oh7F|MetadataUtils.getSectionFromLayout(String, MetadataService.Layout)
11:21:02.897 (897851128)|METHOD_EXIT|[63]|01po0000003Oh7F|MetadataUtils.addSectionToLayouts(List<MetadataService.Layout>, MetadataService.LayoutSection, Integer)
11:21:02.897 (897857352)|METHOD_EXIT|[15]|01po0000003nulZ|FeatureUpgrades.addTrProgressWidgetToLayout(MetadataService.Layout)
11:21:02.897 (897873484)|METHOD_ENTRY|[17]|01po0000003Oh7F|MetadataUtils.processSaveLayouts(MetadataService.MetadataPort)
11:21:02.900 (900292113)|METHOD_ENTRY|[456]|01po0000003Oh7F|MetadataUtils.processSaveResults(List<MetadataService.SaveResult>)
11:21:02.900 (900410769)|METHOD_EXIT|[456]|01po0000003Oh7F|MetadataUtils.processSaveResults(List<MetadataService.SaveResult>)
11:21:02.900 (900418439)|METHOD_EXIT|[17]|01po0000003Oh7F|MetadataUtils.processSaveLayouts(MetadataService.MetadataPort)
11:21:02.900 (900424382)|METHOD_EXIT|[1]|01po0000003nulZ|FeatureUpgrades.doFeatureUpgrades12_11()
11:21:03.583 (903055146)|CUMULATIVE_LIMIT_USAGE
11:21:03.583|LIMIT_USAGE_FOR_NS|(default)|
  Number of SOQL queries: 0 out of 100
  Number of query rows: 0 out of 50000
  Number of SOSL queries: 0 out of 20
  Number of DML statements: 0 out of 150
  Number of DML rows: 0 out of 10000
  Maximum CPU time: 0 out of 10000
  Maximum heap size: 0 out of 6000000
  Number of callouts: 1 out of 100
  Number of Email Invocations: 0 out of 10
  Number of future calls: 0 out of 50
  Number of queueable jobs added to the queue: 0 out of 50
  Number of Mobile Apex push calls: 0 out of 10

11:21:03.583|CUMULATIVE_LIMIT_USAGE_END

11:21:02.903 (903080474)|CODE_UNIT_FINISHED|execute_anonymous_apex
11:21:02.904 (904385970)|EXECUTION_FINISHED